In [75]:
# importing librarries 
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [76]:
# python code to read csv file

data=pd.read_csv("Salary Dataset.csv")

In [77]:
print(data.head())
print(data.info())
print(data.describe())

                Company Name       Job Title  Salaries Reported   Location  \
0                   Mu Sigma  Data Scientist              105.0  Bangalore
1                        IBM  Data Scientist               95.0  Bangalore
2  Tata Consultancy Services  Data Scientist               66.0  Bangalore
3           Impact Analytics  Data Scientist               40.0  Bangalore
4                  Accenture  Data Scientist               32.0  Bangalore

          Salary
0   ₹6,48,573/yr
1  ₹11,91,950/yr
2   ₹8,36,874/yr
3   ₹6,69,578/yr
4   ₹9,44,110/yr
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4344 entries, 0 to 4343
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Company Name       4341 non-null   object
 1   Job Title          4344 non-null   object
 2   Salaries Reported  4342 non-null   float64
 3   Location           4344 non-null   object
 4   Salary             4344 non-null   object
dtypes: float64(1), object(4)
memory usage: 169.8+ KB
None
       Salaries Reported
count        4342.000000
mean            2.775910
std             5.146527
min             1.000000
25%             1.000000
50%             1.000000
75%             3.000000
max           105.000000

In [78]:
# detecting missing values
no_values=data.isnull()
print(f"Missing values: \{no_values}")

Missing values: \      Company Name  Job Title  Salaries Reported  Location  Salary
0            False      False              False     False   False
1            False      False              False     False   False
2            False      False              False     False   False
3            False      False              False     False   False
4            False      False              False     False   False
...            ...        ...                ...       ...     ...
4339         False      False              False     False   False
4340         False      False              False     False   False
4341         False      False              False     False   False
4342         False      False              False     False   False
4343         False      False              False     False   False

[4344 rows x 5 columns]

In [79]:
# detecting total missing values in column
number_of_no_values=no_values.sum()
print(f"{number_of_no_values}")
# data.corr()

Company Name         3
Job Title            0
Salaries Reported    2
Location             0
Salary               0
dtype: int64

In [80]:
# as missing values are very less, we can remove that certain columns
data.dropna(inplace=True)
print(data)

                   Company Name                             Job Title  \
0                      Mu Sigma                        Data Scientist
1                           IBM                        Data Scientist
2     Tata Consultancy Services                        Data Scientist
3              Impact Analytics                        Data Scientist
4                     Accenture                        Data Scientist
...                         ...                                   ...
4339                    TaiyōAI            Machine Learning Scientist
4340    Decimal Point Analytics            Machine Learning Developer
4341                     MyWays            Machine Learning Developer
4342  Market Pulse Technologies  Software Engineer - Machine Learning
4343                    vPhrase             Machine Learning Engineer

      Salaries Reported   Location         Salary
0                 105.0  Bangalore   ₹6,48,573/yr
1                  95.0  Bangalore  ₹11,91,950/yr
2                  66.0  Bangalore   ₹8,36,874/yr
3                  40.0  Bangalore   ₹6,69,578/yr
4                  32.0  Bangalore   ₹9,44,110/yr
...                 ...        ...            ...
4339                1.0     Mumbai      ₹5,180/mo
4340                1.0     Mumbai   ₹7,51,286/yr
4341                1.0     Mumbai   ₹4,10,952/yr
4342                1.0     Mumbai  ₹16,12,324/yr
4343                1.0     Mumbai   ₹9,39,843/yr

[4339 rows x 5 columns]

In [82]:
repeated=data.duplicated()

# for duplicate rows
repeated_rows=repeated[repeated]

# number of duplicated values 
number_of_duplicates=repeated.sum()

print(repeated)
print(repeated_rows)
print(number_of_duplicates)

0

In [ ]:
# removing outliers